---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.HasOverriddenAppearance
source: html/9e03fe36-b253-fa96-82cf-bce35cf7e69b.htm
---
# Autodesk.Revit.DB.MaterialNode.HasOverriddenAppearance Property

Identifies if the default rendering appearance the material has is being overridden.

## Syntax (C#)
```csharp
public bool HasOverriddenAppearance { get; }
```